# Contents

1. Statistical Functions
2. Value Sorting
3. Conditional Statements
4. loc, iloc. set_index

In [1]:
import pandas as pd
df = pd.read_csv('car data.csv')

In [2]:
# Shape of the DataFrame
df.shape

(15, 2)

In [3]:
row, col = df.shape

In [4]:
row

15

In [5]:
col

2

In [6]:
# Top nth rows
df.head()

   speed  risk
0    200    95
1     90    20
2    300    98
3    110    60
4    240    72

In [7]:
df.head(2)

   speed  risk
0    200    95
1     90    20

In [8]:
# Last nth rows
df.tail()

    speed  risk
10    290    82
11    185    59
12    310    93
13     95    18
14     30     2

In [9]:
df.tail(4)

    speed  risk
11    185    59
12    310    93
13     95    18
14     30     2

In [10]:
# Range of entries
df[5:10]

   speed  risk
5    115    10
6     50     7
7    230    85
8    190    45
9    260    91

In [11]:
# Accessing the columns
df.speed

0     200
1      90
2     300
3     110
4     240
5     115
6      50
7     230
8     190
9     260
10    290
11    185
12    310
13     95
14     30
Name: speed, dtype: int64

In [12]:
df['speed']

0     200
1      90
2     300
3     110
4     240
5     115
6      50
7     230
8     190
9     260
10    290
11    185
12    310
13     95
14     30
Name: speed, dtype: int64

In [13]:
df.columns

Index(['speed', 'risk'], dtype='object')

In [14]:
# Accessing nth columns
df[['speed']].head()

   speed
0    200
1     90
2    300
3    110
4    240

In [15]:
df[['speed','risk']].head()

   speed  risk
0    200    95
1     90    20
2    300    98
3    110    60
4    240    72

In [16]:
# Type of column
type(df['speed'])

pandas.core.series.Series

In [17]:
# Type of column
type(df[['speed']])

pandas.core.frame.DataFrame

# Basic Statistical Functions

In [18]:
import pandas as pd
url = 'https://raw.githubusercontent.com/rashakil-ds/Public-Datasets/main/Screen%20Time%20Data.csv'
df = pd.read_csv(url)
df.head()

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
2,2,04/19/19,Friday,112,52,40,8,4,0,3,0,0
3,3,04/20/19,Saturday,101,69,9,38,2,0,3,0,0
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0

In [19]:
df.shape

(28, 12)

In [20]:
df.index

RangeIndex(start=0, stop=28, step=1)

In [21]:
len(df)

28

In [22]:
df.columns

Index(['index', 'Date', 'Week Day', 'Total Screen Time ', 'Social Networking',
       'Reading and Reference', 'Other', 'Productivity', 'Health and Fitness',
       'Entertainment', 'Creativity', 'Yoga'],
      dtype='object')

In [23]:
#max
df['Total Screen Time '].max()

198

In [24]:
#min
df['Total Screen Time '].min()

52

In [25]:
df['Total Screen Time '].mean()

113.25

In [26]:
df['Total Screen Time '].std()

43.562322320164775

In [27]:
df['Entertainment'].mode()

0    0
Name: Entertainment, dtype: int64

In [28]:
df['Entertainment'].value_counts()

0     20
1      4
3      2
32     1
9      1
Name: Entertainment, dtype: int64

In [29]:
 #25%
df['Total Screen Time '].quantile(0.25)

83.5

In [30]:
 #50%
df['Total Screen Time '].quantile(0.50)

111.0

In [31]:
 #75%
df['Total Screen Time '].quantile(0.75)

137.25

In [32]:
 #100%
df['Total Screen Time '].quantile(1)

198.0

In [33]:
 #0%
df['Total Screen Time '].quantile(0)

52.0

In [34]:
df.describe()

,index,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
count,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000
mean,13.500000,113.250000,60.714286,8.714286,14.821429,9.071429,1.285714,1.821429,0.214286,0.571429
std,8.225975,43.562322,22.853571,9.340700,13.754605,6.097532,3.952094,6.188721,0.568112,0.503953
min,0.000000,52.000000,25.000000,0.000000,0.000000,2.000000,0.000000,0.000000,0.000000,0.000000
25%,6.750000,83.500000,41.750000,2.000000,4.750000,3.000000,0.000000,0.000000,0.000000,0.000000
50%,13.500000,111.000000,58.000000,5.000000,9.000000,8.000000,0.000000,0.000000,0.000000,1.000000
75%,20.250000,137.250000,76.500000,13.500000,21.500000,15.000000,0.000000,1.000000,0.000000,1.000000
max,27.000000,198.000000,109.000000,40.000000,43.000000,22.000000,15.000000,32.000000,2.000000,1.000000

# Value Sorting

In [35]:
df.head()

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
2,2,04/19/19,Friday,112,52,40,8,4,0,3,0,0
3,3,04/20/19,Saturday,101,69,9,38,2,0,3,0,0
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0

In [36]:
df['Social Networking'].sort_values()

8      25
25     28
17     34
4      35
26     37
13     40
27     41
11     42
22     42
12     46
24     49
2      52
21     53
6      56
15     60
16     64
5      68
3      69
20     70
10     75
9      76
1      78
19     81
0      89
14     90
23     93
7      98
18    109
Name: Social Networking, dtype: int64

In [37]:
df['Social Networking'].sort_values(ascending=False)

18    109
7      98
23     93
14     90
0      89
19     81
1      78
9      76
10     75
20     70
3      69
5      68
16     64
15     60
6      56
21     53
2      52
24     49
12     46
11     42
22     42
27     41
13     40
26     37
4      35
17     34
25     28
8      25
Name: Social Networking, dtype: int64

In [38]:
df.nlargest(10, 'Social Networking')

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
18,18,05/05/19,Sunday,133,109,5,1,3,0,0,0,1
7,7,04/24/19,Wednesday,135,98,3,33,16,0,0,0,0
23,23,05/10/19,Friday,161,93,13,17,16,1,0,0,1
14,14,05/01/19,Wednesday,127,90,0,10,7,0,0,0,1
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
19,19,05/06/19,Monday,144,81,4,5,3,0,0,0,1
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
9,9,04/26/19,Friday,198,76,8,29,15,0,32,0,0
10,10,04/27/19,Saturday,116,75,10,20,5,0,0,0,0
20,20,05/07/19,Tuesday,110,70,5,6,15,0,9,0,1

In [39]:
df.nsmallest(10, 'Social Networking')

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
8,8,04/25/19,Thursday,52,25,7,3,16,0,0,0,0
25,25,05/12/19,Sunday,52,28,1,1,6,0,0,1,1
17,17,05/04/19,Saturday,58,34,4,5,3,0,1,0,1
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0
26,26,05/13/19,Monday,61,37,1,0,4,0,0,0,1
13,13,04/30/19,Tuesday,79,40,2,9,12,0,0,0,1
27,27,05/14/19,Tuesday,88,41,2,7,15,0,0,0,1
11,11,04/28/19,Sunday,85,42,22,4,2,0,0,0,0
22,22,05/09/19,Thursday,96,42,15,16,19,0,0,0,1
12,12,04/29/19,Monday,109,46,8,13,9,15,1,0,1

# Conditional Statements

In [40]:
df.head()

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
2,2,04/19/19,Friday,112,52,40,8,4,0,3,0,0
3,3,04/20/19,Saturday,101,69,9,38,2,0,3,0,0
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0

In [41]:
df['Social Networking'].max()

109

In [42]:
df['Social Networking'] > 70

0      True
1      True
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9      True
10     True
11    False
12    False
13    False
14     True
15    False
16    False
17    False
18     True
19     True
20    False
21    False
22    False
23     True
24    False
25    False
26    False
27    False
Name: Social Networking, dtype: bool

In [43]:
df[df['Social Networking'] > 70]

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
7,7,04/24/19,Wednesday,135,98,3,33,16,0,0,0,0
9,9,04/26/19,Friday,198,76,8,29,15,0,32,0,0
10,10,04/27/19,Saturday,116,75,10,20,5,0,0,0,0
14,14,05/01/19,Wednesday,127,90,0,10,7,0,0,0,1
18,18,05/05/19,Sunday,133,109,5,1,3,0,0,0,1
19,19,05/06/19,Monday,144,81,4,5,3,0,0,0,1
23,23,05/10/19,Friday,161,93,13,17,16,1,0,0,1

In [44]:
#subseting rows
df[df['Week Day'] == 'Wednesday']

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
7,7,04/24/19,Wednesday,135,98,3,33,16,0,0,0,0
14,14,05/01/19,Wednesday,127,90,0,10,7,0,0,0,1
21,21,05/08/19,Wednesday,122,53,25,26,15,0,0,0,1

In [45]:
#subseting rows
df[df['Week Day'] == 'Sunday']

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0
11,11,04/28/19,Sunday,85,42,22,4,2,0,0,0,0
18,18,05/05/19,Sunday,133,109,5,1,3,0,0,0,1
25,25,05/12/19,Sunday,52,28,1,1,6,0,0,1,1

In [46]:
#subseting rows
df[(df['Week Day'] == 'Wednesday') | (df['Week Day'] == 'Sunday')]

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0
7,7,04/24/19,Wednesday,135,98,3,33,16,0,0,0,0
11,11,04/28/19,Sunday,85,42,22,4,2,0,0,0,0
14,14,05/01/19,Wednesday,127,90,0,10,7,0,0,0,1
18,18,05/05/19,Sunday,133,109,5,1,3,0,0,0,1
21,21,05/08/19,Wednesday,122,53,25,26,15,0,0,0,1
25,25,05/12/19,Sunday,52,28,1,1,6,0,0,1,1

In [47]:
#subseting rows
df[(df['Week Day'] == 'Wednesday') & (df['Social Networking'] == 89)]

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0

In [48]:
#Subsetting using isin()
df[df['Week Day'].isin(['Wednesday', 'Sunday'])]

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0
7,7,04/24/19,Wednesday,135,98,3,33,16,0,0,0,0
11,11,04/28/19,Sunday,85,42,22,4,2,0,0,0,0
14,14,05/01/19,Wednesday,127,90,0,10,7,0,0,0,1
18,18,05/05/19,Sunday,133,109,5,1,3,0,0,0,1
21,21,05/08/19,Wednesday,122,53,25,26,15,0,0,0,1
25,25,05/12/19,Sunday,52,28,1,1,6,0,0,1,1

# Common Q&A

In [49]:
# Please show the rows in the dataframe where 'Week Day' is equal to 'Wednesday' and 'Entertainment' is equal to 0
df[(df['Week Day'] == 'Wednesday') & (df['Entertainment'] == 0)]

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
7,7,04/24/19,Wednesday,135,98,3,33,16,0,0,0,0
14,14,05/01/19,Wednesday,127,90,0,10,7,0,0,0,1
21,21,05/08/19,Wednesday,122,53,25,26,15,0,0,0,1

In [50]:
# Please show the index names in the dataframe where 'Productivity' is greater than 15
df['index'][df['Productivity']>15]

0      0
7      7
8      8
22    22
23    23
Name: index, dtype: int64

In [51]:
# Please show the Week Day names in the dataframe where 'Productivity' is greater than 15
df['Week Day'][df['Productivity']>15]

0     Wednesday
7     Wednesday
8      Thursday
22     Thursday
23       Friday
Name: Week Day, dtype: object

In [52]:
# Show the Rows with minimum Productivity
df[df['Productivity'] == df['Productivity'].min()]

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
3,3,04/20/19,Saturday,101,69,9,38,2,0,3,0,0
11,11,04/28/19,Sunday,85,42,22,4,2,0,0,0,0
24,24,05/11/19,Saturday,58,49,1,2,2,0,0,2,1

In [53]:
# Show the Rows with maximum 'Total Screen Time '
df[df['Total Screen Time '] == df['Total Screen Time '].max()]

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
9,9,04/26/19,Friday,198,76,8,29,15,0,32,0,0

In [54]:
# Please show the index names, Week Day and Social Networking in the dataframe where 'Productivity' is greater than 15
df[['index','Week Day','Social Networking']] [df['Productivity']>15]

    index   Week Day  Social Networking
0       0  Wednesday                 89
7       7  Wednesday                 98
8       8   Thursday                 25
22     22   Thursday                 42
23     23     Friday                 93

# Loc & iloc

In [55]:
df.head()

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
2,2,04/19/19,Friday,112,52,40,8,4,0,3,0,0
3,3,04/20/19,Saturday,101,69,9,38,2,0,3,0,0
4,4,04/21/19,Sunday,56,35,2,43,3,0,1,1,0

In [56]:
#loc -> working with 'index value'. it also can be string.
#iloc -> working with 'index position'
df.loc[0]

index                            0
Date                      04/17/19
Week Day                 Wednesday
Total Screen Time              187
Social Networking               89
Reading and Reference           17
Other                           41
Productivity                    22
Health and Fitness               0
Entertainment                    0
Creativity                       0
Yoga                             0
Name: 0, dtype: object

In [57]:
df.iloc[0]

index                            0
Date                      04/17/19
Week Day                 Wednesday
Total Screen Time              187
Social Networking               89
Reading and Reference           17
Other                           41
Productivity                    22
Health and Fitness               0
Entertainment                    0
Creativity                       0
Yoga                             0
Name: 0, dtype: object

In [58]:
df.loc[0:3] #index value

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
2,2,04/19/19,Friday,112,52,40,8,4,0,3,0,0
3,3,04/20/19,Saturday,101,69,9,38,2,0,3,0,0

In [59]:
df.iloc[0:3] #n-1

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,04/17/19,Wednesday,187,89,17,41,22,0,0,0,0
1,1,04/18/19,Thursday,123,78,17,8,9,0,0,0,0
2,2,04/19/19,Friday,112,52,40,8,4,0,3,0,0

In [60]:
# Create a dictionary with mixed data types
data = {'Name': ['Rashedul', 'Zannat', 'Rishan'],
        'Age': [27, 24, 22],
        'Occupation': ['Data Scientist', 'Software Engineer', 'Teacher'],
        'Salary': [80000, 55000, 70000]
       }

df2 = pd.DataFrame(data)
df2.head()

       Name  Age         Occupation  Salary
0  Rashedul   27     Data Scientist   80000
1    Zannat   24  Software Engineer   55000
2    Rishan   22            Teacher   70000

In [61]:
df2.set_index('Occupation')

                       Name  Age  Salary
Occupation
Data Scientist     Rashedul   27   80000
Software Engineer    Zannat   24   55000
Teacher              Rishan   22   70000

In [62]:
#df2 = df2.set_index('Occupation')
df2.set_index('Occupation', inplace=True)

In [63]:
df2

                       Name  Age  Salary
Occupation
Data Scientist     Rashedul   27   80000
Software Engineer    Zannat   24   55000
Teacher              Rishan   22   70000

In [64]:
df2.loc['Data Scientist']

Name      Rashedul
Age             27
Salary       80000
Name: Data Scientist, dtype: object

In [65]:
df2.iloc[0]

Name      Rashedul
Age             27
Salary       80000
Name: Data Scientist, dtype: object

In [66]:
df2.iloc['Data Scientist']

TypeError: Cannot index by location index with a non-integer key